sownlee/MCAL/env/STM32F407VG/header/Header_DMA.h
#if !defined(HEADER_DMA_H_) 
#define HEADER_DMA_H_

#include "Header.h"

typedef struct
{
  __O uint32_t CR;     /* DMA stream x configuration register      */
  __O uint32_t NDTR;   /* DMA stream x number of data register     */
  __O uint32_t PAR;    /* DMA stream x peripheral address register */
  __O uint32_t M0AR;   /* DMA stream x memory 0 address register   */
  __O uint32_t M1AR;   /* DMA stream x memory 1 address register   */
  __O uint32_t FCR;    /* DMA stream x FIFO control register       */
} DMA_Stream_RegDef_t;

typedef struct
{
  __O uint32_t LISR;   /* DMA low interrupt status register       */
  __O uint32_t HISR;   /* DMA high interrupt status register      */
  __O uint32_t LIFCR;  /* DMA low interrupt flag clear register   */
  __O uint32_t HIFCR;  /* DMA high interrupt flag clear register  */
} DMA_RegDef_t;

#define DMA1                ((DMA_RegDef_t *) DMA1_BASEADDR)
#define DMA1_Stream0        ((DMA_Stream_RegDef_t *) DMA1_Stream0_BASEADDR)
#define DMA1_Stream1        ((DMA_Stream_RegDef_t *) DMA1_Stream1_BASEADDR)
#define DMA1_Stream2        ((DMA_Stream_RegDef_t *) DMA1_Stream2_BASEADDR)
#define DMA1_Stream3        ((DMA_Stream_RegDef_t *) DMA1_Stream3_BASEADDR)
#define DMA1_Stream4        ((DMA_Stream_RegDef_t *) DMA1_Stream4_BASEADDR)
#define DMA1_Stream5        ((DMA_Stream_RegDef_t *) DMA1_Stream5_BASEADDR)
#define DMA1_Stream6        ((DMA_Stream_RegDef_t *) DMA1_Stream6_BASEADDR)
#define DMA1_Stream7        ((DMA_Stream_RegDef_t *) DMA1_Stream7_BASEADDR)
#define DMA2                ((DMA_RegDef_t *) DMA2_BASEADDR)
#define DMA2_Stream0        ((DMA_Stream_RegDef_t *) DMA2_Stream0_BASEADDR)
#define DMA2_Stream1        ((DMA_Stream_RegDef_t *) DMA2_Stream1_BASEADDR)
#define DMA2_Stream2        ((DMA_Stream_RegDef_t *) DMA2_Stream2_BASEADDR)
#define DMA2_Stream3        ((DMA_Stream_RegDef_t *) DMA2_Stream3_BASEADDR)
#define DMA2_Stream4        ((DMA_Stream_RegDef_t *) DMA2_Stream4_BASEADDR)
#define DMA2_Stream5        ((DMA_Stream_RegDef_t *) DMA2_Stream5_BASEADDR)
#define DMA2_Stream6        ((DMA_Stream_RegDef_t *) DMA2_Stream6_BASEADDR)
#define DMA2_Stream7        ((DMA_Stream_RegDef_t *) DMA2_Stream7_BASEADDR)

/********************  Bits definition for DMA_SxCR register  *****************/
#define DMA_SxCR_CHSEL_Pos       (25U)                                         
#define DMA_SxCR_CHSEL_Msk       (0x7UL << DMA_SxCR_CHSEL_Pos)                  
#define DMA_SxCR_CHSEL           DMA_SxCR_CHSEL_Msk                            
#define DMA_SxCR_CHSEL_0         0x02000000U                                   
#define DMA_SxCR_CHSEL_1         0x04000000U                                   
#define DMA_SxCR_CHSEL_2         0x08000000U                                   
#define DMA_SxCR_MBURST_Pos      (23U)                                         
#define DMA_SxCR_MBURST_Msk      (0x3UL << DMA_SxCR_MBURST_Pos)                 
#define DMA_SxCR_MBURST          DMA_SxCR_MBURST_Msk                           
#define DMA_SxCR_MBURST_0        (0x1UL << DMA_SxCR_MBURST_Pos)                 
#define DMA_SxCR_MBURST_1        (0x2UL << DMA_SxCR_MBURST_Pos)                 
#define DMA_SxCR_PBURST_Pos      (21U)                                         
#define DMA_SxCR_PBURST_Msk      (0x3UL << DMA_SxCR_PBURST_Pos)                 
#define DMA_SxCR_PBURST          DMA_SxCR_PBURST_Msk                           
#define DMA_SxCR_PBURST_0        (0x1UL << DMA_SxCR_PBURST_Pos)                 
#define DMA_SxCR_PBURST_1        (0x2UL << DMA_SxCR_PBURST_Pos)                 
#define DMA_SxCR_CT_Pos          (19U)                                         
#define DMA_SxCR_CT_Msk          (0x1UL << DMA_SxCR_CT_Pos)                     
#define DMA_SxCR_CT              DMA_SxCR_CT_Msk                               
#define DMA_SxCR_DBM_Pos         (18U)                                         
#define DMA_SxCR_DBM_Msk         (0x1UL << DMA_SxCR_DBM_Pos)                    
#define DMA_SxCR_DBM             DMA_SxCR_DBM_Msk                              
#define DMA_SxCR_PL_Pos          (16U)                                         
#define DMA_SxCR_PL_Msk          (0x3UL << DMA_SxCR_PL_Pos)                     
#define DMA_SxCR_PL              DMA_SxCR_PL_Msk                               
#define DMA_SxCR_PL_0            (0x1UL << DMA_SxCR_PL_Pos)                     
#define DMA_SxCR_PL_1            (0x2UL << DMA_SxCR_PL_Pos)                     
#define DMA_SxCR_PINCOS_Pos      (15U)                                         
#define DMA_SxCR_PINCOS_Msk      (0x1UL << DMA_SxCR_PINCOS_Pos)                 
#define DMA_SxCR_PINCOS          DMA_SxCR_PINCOS_Msk                           
#define DMA_SxCR_MSIZE_Pos       (13U)                                         
#define DMA_SxCR_MSIZE_Msk       (0x3UL << DMA_SxCR_MSIZE_Pos)                  
#define DMA_SxCR_MSIZE           DMA_SxCR_MSIZE_Msk                            
#define DMA_SxCR_MSIZE_0         (0x1UL << DMA_SxCR_MSIZE_Pos)                  
#define DMA_SxCR_MSIZE_1         (0x2UL << DMA_SxCR_MSIZE_Pos)                  
#define DMA_SxCR_PSIZE_Pos       (11U)                                         
#define DMA_SxCR_PSIZE_Msk       (0x3UL << DMA_SxCR_PSIZE_Pos)                  
#define DMA_SxCR_PSIZE           DMA_SxCR_PSIZE_Msk                            
#define DMA_SxCR_PSIZE_0         (0x1UL << DMA_SxCR_PSIZE_Pos)                  
#define DMA_SxCR_PSIZE_1         (0x2UL << DMA_SxCR_PSIZE_Pos)                  
#define DMA_SxCR_MINC_Pos        (10U)                                         
#define DMA_SxCR_MINC_Msk        (0x1UL << DMA_SxCR_MINC_Pos)                   
#define DMA_SxCR_MINC            DMA_SxCR_MINC_Msk                             
#define DMA_SxCR_PINC_Pos        (9U)                                          
#define DMA_SxCR_PINC_Msk        (0x1UL << DMA_SxCR_PINC_Pos)                   
#define DMA_SxCR_PINC            DMA_SxCR_PINC_Msk                             
#define DMA_SxCR_CIRC_Pos        (8U)                                          
#define DMA_SxCR_CIRC_Msk        (0x1UL << DMA_SxCR_CIRC_Pos)                   
#define DMA_SxCR_CIRC            DMA_SxCR_CIRC_Msk                             
#define DMA_SxCR_DIR_Pos         (6U)                                          
#define DMA_SxCR_DIR_Msk         (0x3UL << DMA_SxCR_DIR_Pos)                    
#define DMA_SxCR_DIR             DMA_SxCR_DIR_Msk                              
#define DMA_SxCR_DIR_0           (0x1UL << DMA_SxCR_DIR_Pos)                    
#define DMA_SxCR_DIR_1           (0x2UL << DMA_SxCR_DIR_Pos)                    
#define DMA_SxCR_PFCTRL_Pos      (5U)                                          
#define DMA_SxCR_PFCTRL_Msk      (0x1UL << DMA_SxCR_PFCTRL_Pos)                
#define DMA_SxCR_PFCTRL          DMA_SxCR_PFCTRL_Msk                           
#define DMA_SxCR_TCIE_Pos        (4U)                                          
#define DMA_SxCR_TCIE_Msk        (0x1UL << DMA_SxCR_TCIE_Pos)                  
#define DMA_SxCR_TCIE            DMA_SxCR_TCIE_Msk                             
#define DMA_SxCR_HTIE_Pos        (3U)                                          
#define DMA_SxCR_HTIE_Msk        (0x1UL << DMA_SxCR_HTIE_Pos)                  
#define DMA_SxCR_HTIE            DMA_SxCR_HTIE_Msk                             
#define DMA_SxCR_TEIE_Pos        (2U)                                          
#define DMA_SxCR_TEIE_Msk        (0x1UL << DMA_SxCR_TEIE_Pos)                  
#define DMA_SxCR_TEIE            DMA_SxCR_TEIE_Msk                             
#define DMA_SxCR_DMEIE_Pos       (1U)                                          
#define DMA_SxCR_DMEIE_Msk       (0x1UL << DMA_SxCR_DMEIE_Pos)                 
#define DMA_SxCR_DMEIE           DMA_SxCR_DMEIE_Msk                            
#define DMA_SxCR_EN_Pos          (0U)                                          
#define DMA_SxCR_EN_Msk          (0x1UL << DMA_SxCR_EN_Pos)                    
#define DMA_SxCR_EN              DMA_SxCR_EN_Msk                               

